[
    {
        "rating":"4.3",
        "sentiment":"negative",
        "review":"Good,Sound is very low another brand comparing in better,Service provider not meet my home refuse, tv i am not using bad service,Good product,Ok super,Floor stand does not come with it ...,Good,A budget friendly TV with a clumsy UI and Remote. Overall good.,TV picture ok smart betterSound very low another brand,Service provider refuse install my TV, bad service and samsung, I am calling 3 times service provider. Not meet my home address.why ? Bad bad,They product did not come with the support stand or wall hanging hook to install the Tv,Picture quality is very poor in cables,Floor stand does not come with it ... You have to buy it seperately. Request Amazon to cleary mention it in the add . You will have to pay seperate charges for the installation guy to buy the floor mount .,Good,"
    },
    {
        "rating":"4.3",
        "sentiment":"negative",
        "review":"Good,Sound is very low another brand comparing in better,Service provider not meet my home refuse, tv i am not using bad service,Good product,Ok super,Floor stand does not come with it ...,Good,A budget friendly TV with a clumsy UI and Remote. Overall good.,TV picture ok smart betterSound very low another brand,Service provider refuse install my TV, bad service and samsung, I am calling 3 times service provider. Not meet my home address.why ? Bad bad,They product did not come with the support stand or wall hanging hook to install the Tv,Picture quality is very poor in cables,Floor stand does not come with it ... You have to buy it seperately. Request Amazon to cleary mention it in the add . You will have to pay seperate charges for the installation guy to buy the floor mount .,Good,"
    },
    {
        "rating":"4.3",
        "sentiment":"negative",
        "review":"do not buy. tv on off not working, so difficult to battery really a bad product"
    },
    {
        "rating":"4.3",
        "sentiment":"negative",
        "review":"Product life ia short,Good,Waste,Value for money,Very nice product at a reasonable price. Value for money.,Good replacement cable at this price,Worst cable. Not working even after replacement. Dont buy guys Manufactured in China.,Not working. Good and easy to use but product life is hell short. It means you have to buy it within next six months.,Good,Better,Quality is good and working as expected.,,Decent replacement cable for my aging external hdd. Works at usb 3.0 speeds,Worst cable. Not working even after replacement. Dont buy guys Manufactured in China.,The USB cable was useless. After logging in this cable, I was not able to transfer data from one laptop too another."
    },
    {
        "rating":"4.3",
        "sentiment":"negative",
        "review":"Sensors burnt my wrist upon wearing overnight,Worst to buy,👍👍,It's  good,Low battery life and it's okay to buy,Superb 😘,Good,Good product. The sensors has burnt at two point of more than 3mm dia on my wrist upon wearing overnight and I have abandoned using it out of fear.  Had enclosed photos herewith.,Worst to buy, it's belt quality is totally poor, performance is average, not proper tracing of activities and battery life is too average.,Value for money,It's  good,Low batter life,Nice Smartwatch, Big Display, Long Battery Life, Max Features,Good,Good product"
    },
    {
        "rating":"4.3",
        "sentiment":"negative",
        "review":"Real Monster 👽,Overall good,Good performance oriented phone,An all Rounder in the < 30k segment,All good, battery life could be better.,A good Phone with few disadvantages.,Value for Money product,❤️. Posting This After 8 Days of Continous Usage:I came from Oneplus 5t that too because last to last week I had an accident and my 5t has dead on the spot.After watching a lot of reviews on Youtube and Amazon, I thought I should give it a chance.First Impression:-• As you all know OP 5t has small display so it's hard for first 3-4 days to use\/Typing because of big display.• A little heavy but that could be because of upgraded species and battery from my last 5t.• Solid built but it if it's metal build then it will be more beautiful.• Space fusion color is looking killer.• Flash charger works awsome but charger design can be improved• Display is crisp and clear but but in dark apps (i.e, chrome, brave, linkdin etc) you'll notice a color change (from Black to Greyish color) that gives a cheap feel and I don't know if it's a software or hardware issue.Actual Review:-• While gaming (Call of duty:mobile) has some lags and bugs and there is no option to block notification\/calls even after mute notification ONN everything is coming on screen and it's very frustrating and annoying.• Battlefield mobile ground, Asphalt 9, Clash of Clans, Battle Royale are working flowless.• Some apps like Flipkart and Airtel gives some error (screen zoom automatically while opening) might be because of android 12 or something else.• Now this is very weird that this phone reset a few setting automatically themselves when I don't want that. I don't want to set them everyday before using my phone (i.e, I am using Bouncer to remove app permission when not in use and this phone remove accessibility setting even after batter optimization and background run.While listing to music I want paranomic 360 sound but it reset to default automatically.• Gesture are not working fine, this can be fixed with future updates.• I admit that funtouch OS has some more customization then Oxygen OS but it is missing some basic customization feature like I cannot change accent color, shape, size and the default one is looking very cheap must be because Oneplus oxygen OS is in my eyes but I am not overcome from oxygen OS, Oxygen Os is lub• Funtouch OS is very uncomfortable for me for the first 4-5 days but now I'm getting it a little.• Less feature in gaming mode in comparison to Iqoo 7📷Camera:-• Average as of now takes good picture in night\/evening time and selfie camera is awsome.• OIS works good as per the budget and gives value for money.• Day time picture are good but something it changes the saturation\/color by itself automatically.• No heat observed while gaming\/doing heavy task (minimal heat that every phone has now a days and it is 40°c outside so this is not a big deal for me.• Screen recorder and mic works awsome• Crisp clear display except the issue I told above• 6-7 SOT in one charge (0-100)• 42-44 minutes charging time (0-100)• No bugs lags observed till date• 120Hz refresh rate made it monster• Some preinstalled bloatware can be uninstall but some has to be force stop only or you can use Adb commande to remove permanently.• A few apps are unnecessary like browser and a screen (virus scan) comes just after install an app from play store that very annoying and somehow I stopped that.• Speaker volume is sufficient (enoug loud in a room)Conclusion:-In 31k it's worth for money with Snapdragon 888 processor and intelligent chip.Only thing that I don't like is funtoch os because it not gives a premium flagship phone experince.Has some bugs as of now (i.e, In gaming mode, in a few apps, camera, Display) that might fixed with future updates.Overall worth for money, And Yes you can pick it over Oneplus 9RT (like I said you'll probably feel bad for a week with it's Funtoch Os but you'll be okay with it after sometime.Just because of oxygen os spending 8-10k is not a great idea I think.,Camera quality is good , Video stability is awesome, processing and other functions are nice .  UI is not that good and battery life is not upto the mark,Pros:- Super fast app experience due to Snapdragon 888- Super fast charging- good display but not comparable with Super Amoled of Samsung\/ other phone- Good large display size- No heating in general use. Only seen when using camera \/video call but it cools down fast.- Accessories given with the phone like Fast charger, USB c to 3.5 female adater, thin screen guard and translucent back cover.- Ok camera:Cons:- Display is not super amoled or vivid like Samsung A or S Series phone- Battery drains fast- Avg front camera- Earth current can be felt when touching back camera while charging.,I was skeptical about the phone would perform as SD 888 has its own share of heating issues and all, but for 28k, this is one of the best phones in the segment.I had Pixel 6A and Nothing phone 1 as other options. Although their camera and software might be better in some aspects, the performance, the camera and gaming features this phone offers is incredible.Also Pixel and Nothing phone dosent give charger in the box so it's a plus point.The only issue I faced is when I switch the phone to 60Hz. It starts to act as it lowers to 30,40 fps or something. And the battery life is average. It's 1 charge in the evening for sure. But decent battery coupled with a fast charger is more than enough.I use nova launcher with this and this solves the home screen style. Recommended to all.,Good display, good sound although sound is not much loud but have a sweet bass, smooth experience, camera good but front video could be given 60 fps, good haptic, every thing is good up to the mark but battery life could be better. Overall satisfied with the product.,They are ok, i can rate 2.5\/5,Mobile is worth its money.,Idont use fingerprint and camera are very good battery life ok"
    },
    {
        "rating":"4.3",
        "sentiment":"negative",
        "review":"Good,Sound is very low another brand comparing in better,Service provider not meet my home refuse, tv i am not using bad service,Good product,Ok super,Floor stand does not come with it ...,Good,A budget friendly TV with a clumsy UI and Remote. Overall good.,TV picture ok smart betterSound very low another brand,Service provider refuse install my TV, bad service and samsung, I am calling 3 times service provider. Not meet my home address.why ? Bad bad,They product did not come with the support stand or wall hanging hook to install the Tv,Picture quality is very poor in cables,Floor stand does not come with it ... You have to buy it seperately. Request Amazon to cleary mention it in the add . You will have to pay seperate charges for the installation guy to buy the floor mount .,Good,"
    },
    {
        "rating":"4.3",
        "sentiment":"negative",
        "review":"Pathetic amazon delivery service,Decent Indoor Security Camera,Camera used by me,Other than initial hiccups, some (Mi Home app) software bugs, it is good for monitoring!,Works well,Nice camera but motion censor doesn't work,Good,Not up to mark. I ordered this mi camera recieved the product but it was defective not working properly so i called customer care and placed the request for replacementThe replacement order was supposed to be delivered by 26 dec 2022But today is 3rd jan 2023 it is yet not delivered i am being told the package has been lost you return the defective product and you will get the refund.After waiting so long the product is not delivered and i will get the refund very bad service from Amazon,Night Vision is Good sometimes person detected notification will be delayed and motion detection sometimes doesn't work other than that everything is good,The camera supports 64GB of memory card, while the online storage as mentioned in the details of 7 days rollover in India is missing.,Remember... nothing is perfect. Xiaomi has already released home security cameras using other brands such as Yi. And the home security camera market is yet to be adapted in large. So, you can expect a lot of misunderstanding on how everything works together in a home security camera in general.Initial setup: It is a breeze for some, but pain for others. See the 1-star ratings if you want proof. I had trouble getting this camera recognized by its own app (Mi Home). It took about 1 hour to recognize after trying with different lighting conditions. The camera got disconnected from the app, after I switched the SSID of the router. So, I had to pair it again. This time, it took more than a day(!) of trial and error. I had to keep the camera under bright sun light in order to get recognized by the Mi Home app. Lesson learned in a hard way.Bandwidth requirement: This camera requires 24x7 connectivity with solid internet connection and with good upload bandwidth. Even if you have 100mbps connection, this camera can only be connected via wireless. So, longer the distance from the router, shorter the bandwidth. This camera hangs up, if it doesn't have enough bandwidth. If you add NAS storage, you'd need even more bandwidth between the camera and the router. The camera is very sensitive. If you set up any conflicting configurations, it'd just hang and would not record anything at all, even in the on-board SD card storage. If the camera hangs for a particular reason, you have to restart it. It is a pain to troubleshoot things when you are miles away from home in another city.Mi Home app requires almost all the permissions from your phone. But, I was able to disable most permissions except location and storage. What's more! You get ads in the app right after opening it (on the dashboard where you see the list of devices) since version 5.4.43 (released on Dec 26, 2018). I wish Xiaomi released a dedicated app for home security cameras, like other companies have done.Google Assistance isn't compatible with this camera, if you are into that sort of thing. Some other cameras from Xiaomi (not released in India) are supported, though.Once paired to the app and once you have the perfect setup (with NAS and good wireless bandwidth to \/ from the camera), you may become addicted to use it under different conditions, such as with total darkness.If you are technically sound and have around 10k budget, Raspberry Pi based home security is a better option! If you are on a budget and if you don't want to spend a lot of time on technical things, then, Xiaomi Mi Home Security Camera is the best home monitoring camera you can get!,Good enough! It works as it shown,Nice camera and easy to install. Only issus is motion censor doesn't work,It's good but price is high and sometime it's not working so good can't take motion recording.,Not up to mark"
    },
    {
        "rating":"4.3",
        "sentiment":"negative",
        "review":"How to choose an iron ? This one-A decent combo of features & price.Cable quality not good though.,Quality Iron for power users with effective spray & steam function | Review | Guide | Tips,Doesn’t remove hard wrinkles.,Easyto use but it leaks water,Very easy to use,Good product,Quick warm up,Not good. Update as on 28.10.2018:*********************************The power cord has developed twists beyond repair and the seperate cores are now visible,the insulation pvc of the cores doesn't look very durable.I don't know why such standard manufacturers can't provide a decent durable cable?The iron however is performing flawlessly.Still disappointed ,as in coming weeks i'll have to change the cable for sure.Reducing one star for compromising upon the cable quality by such a big brand name.HOW IT STARTED - THE NEED FOR AN IRON:xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxRecently , my previous Bajaj make dry iron, which I received as a gift from somewhere, started giving problems after two years of occasional use & with “not so careful handling and care”. Initially, Its wires insulation inside was found rotten around the iron entry point which I repaired myself and later its thermostat started giving problems. Finally, its ON indication went OFF and I decided that it was time to bid goodbye to it and find a new one.Hence, my search for a reputed brand make , best value for money device began .Being from Electrical Engineering background & occupation, I fairly summed up my expectations from the power device as below:1.) DRY IRON VS STEAM IRON :xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxThis was fairly simple if we consider the explanation that a steam iron could perform as a dry iron but vice-versa was not possible. Also, almost always you find some or the other stubborn wrinkles and crease distortions that is hard for the dry iron to overcome and you need to use water for the purpose.On the contrary, As the steam  loosens the individual fibres of the clothes, the steam iron's pressing action smooths out wrinklesHence it was better to be  equipped with the facility in the first place in the device itself.2.) BRAND REPUTATION & WARRANTY:xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxAs an average consumer, We are not wrong in generally assuming that products of bigger established brands have a higher quality and perform better. Rightfully so ,A brand which has been working with a product for decades has a plenty of experience & research regarding the possible points of failures of the product and can be surely trusted upon.Following the same footprints I thought not to take bets upon power devices like iron and go with the Super brands like Philips having decades of expertise in this field..Our product comes with a two year global warranty which is quite decent in my opinion .3.) STEAM OUTPUT , STEAM BURST & VERTICAL STEAM FEATURE:xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxDuring normal usage with steam a delivery of anything above 8 grams\/min is okay but Some ironing jobs such as curtains or quilts require a much more supply of steam. In such cases the steam burst feature comes in handy. Users can push a button to receive a burst of steam when needed. More holes in the sole plate add  to the effectiveness of steam  supplied.Vertical steam feature in theory can direct clouds of steam  in and around vertically hung garments or curtains which eliminates wrinkles without the need for a pressing force.However in practical scenario and by virtue of  its design and water tank limitations , a steam iron is virtually incapable of  addressing the wrinkles like that and  hence paying more for such a feature is not advised.Use dedicated garment steamers for that purpose.** Our Philips GC1905 comes with a variable setting for steam  output with a continuous delivery of  up to 17 grams\/min which is quite good.Additionally, It can provide steam burst too for stubborn wrinkles. Vertical steam feature is not available though.4.) ELECTRICAL RELATED FEATURES: WATTAGE, CORD,THERMOSTAT etc.xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxThe simple maths that more watts means more heat or more steam or quick heating is not as simple as it looks.1. Surely, more watts means more heat generated but more wattage limits our ability to plug the iron at any socket in the house as for any power above 1500 Watts , I would suggest to only plug-in to the power sockets.Going for more power demands must be backed up with careful examination as to whether you  really need that much heating if its normal clothes only that you need to iron most of the times.2. Surely, More heat developed  is capable to deliver more steam but that depends upon the number of holes in your sole plate for it to be really effective ,Your water holding tank size and lastly steam delivery settings.Generating too much steam without delivery can be dangerous as it can pressurize the system.3. Last but not the least - More power  doesn’t always mean  quick heating as heating of the sole plate depends upon a number of factors like the material & thickness of the sole plate , Surface area of  the heating element used  inside the soleplate etc.Most of  these intricate details are variable in nature and cannot be specifically mentioned by the manufacturer.** OUR PRODUCT:# Comes with a decent 1440 Watts of power good enough for routine casual use along with occasional use on heavier fabrics.# Comes with a 250 Volts, 10 Amp ( Max. rating of plug is always extra to actual amperage) 3 pin Top which can  be easily plugged into our casual 6 amp sockets as well without any damage to the socket.Hence enhanced mobility & performance.# The cord length is around 1.8 meters which is good enough for any practical lengths,Any more than that would be cumbersome to handle.. The cord  is braided with an insulated  cotton sleeve which is useful for twists as well as insulating during a cable damage.However in due course of use, the cord often develops rigid twists & turns beneath the cotton braiding which is hard to straighten out.So not so great on the cable quality terms.# The cable only comes with 180 degrees of swivel movement, which is quite disappointing and I would  have  really wished if it was 360 degrees of cord freedom.# The thermostat knob for temperature selection comes with regular 5 settings but going with a reputed brand like Philips always assures of a good quality of thermostat.After all, the thermostat is the heart and soul of modern day irons and must be highly durable and reliable.# Lastly our product is an ISI marked product  which is quite an assurance for sure.5.) SOLEPLATE MATERIAL & SHAPE:xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxThis is probably the toughest part where each company claims to have the best and easy gliding soleplates.A variety of soleplates are available in the market today like non-stick Teflon coated ,aluminium plates with American  heritage coating, Steel plates with alloys or Ceramic coated.Each has its pros and cons.# Teflon coated plates are easy to get scratched and gather dirt over a period of time.# American Heritage is similar to Teflon and glides over the fabric even better.# Stainless steel is the most durable and easy to clean however may stick to clothes on higher settings.Adds weight to the device. Metal works better than ceramic for pressing in sharp creases on sleeves and trousers.# Good for smooth gliding and even heat distribution  but biggest advantage is to eliminate static charge at high temperatures which may cause clothes to stick.When  ironing on synthetics and fabrics blended with spandex, a ceramic iron will suit your needs best, as ceramic does not stick to these fabrics but the coating may peel off on rough handling.# Aluminium soleplates heat up quickly but are prone to damage and may stick to clothes.** Our Product comes with a linished soleplate which  is quite inadequate detail as linishing is a process of grinding or polishing a surface to make it a perfect flat.# However apart from linishing stuff, I can surely say that the soleplate in our device is decent gliding but not the best gliding, Its heavy but doesn’t stick to the clothes yet.For that matter I trusted  the brand reputation and went ahead with this linished soleplate. Stay away from Teflon coated ones though as its bound to wear off  fast.Regarding the shape , I honestly wanted  it to look like American fighter planes with sharp beak design and dark colors..LOL..However ,those models with my looks were weak in overall specs so had to settle down with this “Still-Decent Looking “model.6.) FEATURES LIKE ANTI DRIP ,ANTI-CALC, GRIP:xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxTo tell you the truth these are more of a fancy terms rather than actual purpose  for most of the users. Presence of these features, isn’t a problem  though , as in areas where the water comes hard, Anti-calc may stir and clear the calcium build up ,if any in the water tank.However ,If you use proper water, drain it out timely , Do not fully fill the tank , allow it to heat before using steam  & follow all procedures correctly, you won’t actually need to use these features.Regarding Grip ,Many iron nowadays have some unique design which is set ergonomically to give a better grip.** Our product comes with the anti-calc function  and is decent to grip though I think not ergonomically, still nothing for a deal breaker and these are minor features to discuss upon.7.) PRICE VS PERFORMANCE:xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxEven though I did not have any preset price tag in my mind  but still going over 2500 would have definitely felt extreme for a thing that I don’t make use of that much.** I bought it at a price of around 1200 bucks & for  all the features and performance it delivers - I think it is worth it.FINAL VERDICT:xxxxxxxxxxxxxxxxxxxxAll in all , I would just say, that even though our product might not have the best  appealing looks or the best soleplate or  the best burst of steam or the best swivel of the cord , still, what it has is  – a complete package of all the individual features clubbed together in a decent right-performing way, which is hard to come by in an  individual model.,I got this one on-demand from mother. For a few days, she was insisting on buying one iron for daily chores. I was already researching iron for one of my friends. So this search did not last long. :DEven earlier, Philips was the only name that came to my mind due to its consistency & product quality. I also had Bajaj, Usha, Morphy in the list. But trust in Philips did not let me go for any other brand.I got this Iron well in one piece and without any scratches on the soleplate.•••••••••••••••INSIDE BOX•••••••••••••••→Steam Iron inside a poly pack→Instruction leaflet\/Warranty card•••••••••ABOUT•••••••••Wattage: 1440 wattWeight: ~1 kgWater Capacity: 180 mlCord length: 1.8 meterIndicator: on\/off (based on temperature setting)Max Water level markingWarranty: 2 years•••••••PROS•••••••1. Good quality iron with effective ironing & steaming.2. Body is solid with good finish overall at this range.3. Linished- Teflon coated soleplate for easy gliding on all fabrics. Gliding is somewhat limited in steam mode due to moisture.4. Sufficiently long cable with swivel joint at iron for easy movement and usage.5. Capacity of the water tank is sufficient for average steaming operation (30 min or more in one fill).6. Spray function is well designed, it evenly sprays water and not just throws a fine jet of water.7. The spray function produces a fine mist that evenly moistens the fabric, making it easier to iron out tough creases.8. Wattage (1440w) is sufficient enough for home usage and can easily cover tough wrinkles and heavy clothes.9. Easy and fast filling of the tank owing to the huge filling hole.10. Easy and complete emptying of the water tank owing to the large hole, and the sideways opening door.11. Weight on the ok side, not a lightweight but not even heavyweight. Some weight is useful as it helps ironing by applying pressure on the cloth. (Empty iron is lightweight only.)••••••••CONS••••••••1. Steam control knob looks loose at first, but it works well in the long run.2. Water movement during iron creates jerks and affects smooth operation. But that's the way it will work & you can't do anything.3. For regular lightweight iron users, it will appear bulky at first. But you get used to it in a few days.4. No steam burst function in this model GC1905 but you get what you pay for.▶ Cons are temporary and don't affect functionality in the long run. So a ★★★★★ device.•••••••••••••••••••••••••BUTTONS & KNOBS•••••••••••••••••••••••••Spray Button→ push to spraySteam Knob→ Off: no steam→ Low: less steam→ High: high steam→ Calc clean mode: calcium deposit cleaning (more below)Temperature Dial→ Rotate to set temperature cutoff for different fabric types (Linen, Cotton, Woolen, Silk, etc)••••••••••••••••••USAGE GUIDE••••••••••••••••••1. Keep knob & dial in off position.2. Fill the tank to the max level if planning to use steam function.3. Connect to mains.4. Set the temperature control knob to the required position.5. Let it warm up until the indicator goes off.6. Now operate steam knob to low or high steam.7. Enjoy ironing or steaming without interruption till water lasts.8. Use water spray function as required.•••••••••••••••USAGE TIPS•••••••••••••••1. Use RO filtered water if possible as it's low in hardness and will ensure the longevity of iron without choking the vents or orifices.2. let the iron heat properly before use. Leakage has been observed if one uses the Iron without heating properly as water will directly pass from vents without getting converted to steam.3. Gently clean soleplate and don't use any hard material or chemicals.4. Emptying water tank every time after usage is recommended to avoid scaling problem. As calcium deposits are more in standing water.5. Untangle & straighten the cord once after every use before storage. As these cords tend to develop sharp irrecoverable turns over time and those are hot zones for cable failure.6. When not using steam function keep the steam knob in off position.7. Use calc clean mode once in 2 weeks if using normal tap water with medium hardness. If water is very hard, increase the frequency or if using RO water decrease frequency.8. Once in a few months clean steam control needle using vinegar. To remove the needle, rotate the knob to calc clean mode and gently pull it out.9. Last but most important, use a properly earthed wall socket for iron to avoid shocks.•••••••••••••••••••••••••••••CALC CLEANING MODE•••••••••••••••••••••••••••••This iron has a calc cleaning mode to descale it. To do so follow the steps below:1. Keep knob in the steam off position.2. Fill tank to max level.3. Rotate temperature dial to max position and wait for the indicator to go off.4. Take out socket from mains and move iron to sink.5. Turn the steam knob to calc clean position and pull it up a few cms.6. Let all water be used up.7. Steam and hot water come out along with calcium deposits.▶ The principle behind this function is a sudden change in temperatures of inside zone, which leads to contraction & expansion resulting in scaling shredding and flush out.•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••CLARIFICATION: DAMAGE TO BODY OR PLATE & OTHER ISSUES (concerns raised by other users)•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••Several users posted about the damaged product or soleplate on arrival and other usage issues. Let me put my insights into those.→ I had no issue with the quality of the product delivered. It arrived in proper condition without any damage anywhere, as proper care was taken for this using air cushions. Maybe their seller was careless enough and that resulted in damage during transit.→ Soleplate had no marks on it. Yes, here Philips can provide a protective sticker or film on the plate which will reduce the ratio of complaints, for the damaged sole plate on arrival.→ Temperature dial works properly and markings are intact after months of usage.→ Slight difference in color tone maybe there across different zones, as different materials are used as per requirement. Say hot zone near plate vs cold zone at back.→ Leakage will be there if the steam knob is in steam position and iron is not sufficiently hot to convert incoming water. So it's passed directly, & appears as leakage. Philips has explicitly mentioned this in product details.▶ Remember to order it from a reputed seller. Check seller ratings, reviews and amazon verified tag to avoid any issues, like the faulty product, duplicate product, etc.••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••DON'T GET CONFUSED (There's No Steam Burst Mode Here)••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••1. Some of the photos displayed are with steam burst function symbol on the button & even some users have mentioned this in their reviews, but it is not present in this model. Models with the said function have two buttons (for spray & burst) instead of one here (for spray only).2. Also, steam output at one place is 13g\/min, another place 17g\/min. Its actually 17g\/min.•••••••••••••••••••FINAL VERDICT•••••••••••••••••••▶ If you are looking for good quality, durable steaming iron in the 1.5k range, Philips is the name you should seek for. This model of Philips has got good build quality & features which are more than enough for an average home user. So at any point, you can go for this model.▶ If on a lower budget (<1k range) you can go for Philips GC1011 1200w or Bajaj MX 3 1250w but both are low power and Philips one misses steam spray function too. But still, both will cover most of the usage pattern of a home user.▶ Heavy users may go for Philips EasySpeed Plus GC2040 2100w or Black+Decker BD BXIR2001IN 2000w or Morphy Richards Super Glide 2000w in 2k range.••••••••NOTE••••••••→ Unlike regular lightweight irons, steam irons generally don't go easy with repairs.→ Unlike regular iron, If the coil is damaged in the steam iron whole of the bottom plate needs to be replaced & if you are out of warranty it will cost you a lot. In fact, for the cost of the plate plus a few bucks, you get a new iron.→ So, check your requirement for regular vs steam iron & choose wisely.,I tried removing hard wrinkles of a jeans but it couldn’t remove them properly. They were still visible even after using the steam.,Easyto use but it leaks water,Very good,Its a good product,Iron is good and the best delivery with few hours, just this iron doesn't have a stream burst...rest is good,Simple cloth iron"
    },
    {
        "rating":"4.2",
        "sentiment":"negative",
        "review":"Product as describe,Good product,Good product but price high.,I miss my gas stove.... Induction sucks :(,Great value,No1,तेल गर्म करने में परेशानी,Good. I recvd product within 3 dys while owing to rural area other product tks 10 dys to deliver n product recvd at gd condition n works well, aftr use if smthng cms up will review again,It works good. Nice heating. But hard to clean as it has ridges and small gap between the hot plate and the controls and also below the plate edges.. Other than that, fine product,2500 se jyada price nahi hona chahiye tha. Use karne mein bahut achha hai,Over all I'm really disappointed by the product and especially cooking experience. I was used to normal gas and it was easy to regulate to propper temperature. This product has only like 8 temperature settings and it is either too hot or too cold and cannot be set in middle. For example when I set 160°C then it is burning toasts and onions... When I set one step lower it is 130°C and it is not enough for frying :(((.Also you need to buy more expensive induction friendly cookware. And even when I invest to expensive Tefal pan it heat mostly in the center and it is much colder on the edges... You can see on pictures that watter boiling only in middle, and toast being burnt in middle and raw outside :((( The pan is very good and has induction area over whole bottom so I'm sure the fault is in this philips stove... You can see the pan from bottom that induction area is almost over whole bottom... Also due to fact that only center is hot then frying onions is taking much longer than on normal gas stove where heat is better distributed :((( And even though you spent more time frying the onions the result is worse... Onion is little burned from outside and still not soft inside... I'm really disappointed by frying experience compared to gas stove...There is one positive side and that is that heating is quick. My pressure cooker star whistling quite quickly. Faster than on gas stove. Also you can set time for like 10 minut and leave it which is quite convenient...Controll is easy. But I hate details. First I love one detail. There is \"pause\" button which is very cool. If something heats too quickly or you just need to quickly do something else you press pause button and there is no new heat - It is much nicer compared to gas stove where you would need to turn off, light up again and then find right flame again... Here you just press pause again and cook as before... But that is only thing that I love. Otherwise I hate how it is designed.... First basiclly whole top row of buttons is useless. Those buttons are preset temperatures. But anyway those temperatures are wrong or just for items you do not cook... Like there is 'stirr fry' button and it set 180C. It totally burns onion... I set usually 180C for beginning and then soon change for 160C. But even 160C is too much burning... But lower setting is only 130C which is not frying at all. I would need like 150C I guess and it is impossible to set :((( ...Also I noticed another issue that stove is sometimes making automatic pauses. It heats and than probably when it thinks it is too hot then it stop completelly and in like 10 seconds starts again. So instead of consistentn temperatures it is doing on and off.But back to controll. Except from fact that preset temperatures are useless when you want to change temperature it won't let you or let you to do only one '-' but not 2 times '-'. Why??? I don't know probably ill will... You need to first press \"manual\" button which change temperature completely to 130C and only then you can freely press +\/- and set your desired temperature. So basically I never use any preset mode and I always only press 'manual' and +\/- to set my temperature...Another control is setting time. I must say satting time is useful feature and I love it, but how it is implemented I hate. When you press time button then by default it set 30 minutes... Ok but when you hold '-' button it jumps so quickly that in one second it counts to 0 and roll to 3 hours.... Holding increment\/decrement is so quick that it is useless. It must have implement some idiot... Anyway you can always click one by one. So to set 10 minutes you must click 'time' button and then click 20 times 'minus' button to set 10 minutes... It is doable but pretty annoying. Or I long press '-' it usially jumps directly to 3 hours and then I press 11 times +...  Still anoying but I save like 8 clicks... What is super idiotic is that when I want to add 5 minutes I click time and it by default set 30 minutes again :(((( Arrrrggghhhhh.... So instead of just click time and 5 times '+' I need to click 25 times '-' :((((.... Really this must have done some idiot.... Another unpleasant thing is that if you need to change temperature you can not... Imagine something starts burning and you need to wait like 3 seconds and not pressing '-'\/'+' and then after those 3 seconds time setting mode is automatically left and it will let you change temperatures again... When controlling  stupidity is burning my food it makes me angry :((((So over all I would buy anything else next time... Maybe it will be worse but I would at least try...Anyway to say something positive at the end I like that product looks quite durable and material quality looks good. Packaging was also well. But power cable is only like 1.2 meters.... That might be too short... But for me just enough... Also I like mechanic buttons, some stove has capacity buttons which is cool looking and totally flat but I like to feel the press and the click. Buttons are under foil so there is no risk of something leaking into them. Cleaning is very easy cos it is almost flat :) Cleaning experience is much better than cleaning gas stove...,Product is good but service center problem not available nearly.,No1,तेल गर्म करने में परेशानी,Ordered 3 one was faulty"
    },
    {
        "rating":"4.1",
        "sentiment":"negative",
        "review":"Wrong battery,It's working,Good,Ordinary product,Good,Poor packing not expected from a reputed brand like HUL😣😣😣,Water purifier,upset with product not good. The battery was not fitting,This time the filters have some change in design and filter the water faster, I don't understand why Amazon sent it with direct item pack instead of packing,Good , regular and useful product,The product quality is going down day by day,Good,product packing is not at all professional its not all expected from a reputed brand like HUL,Nice,not good product"
    },
    {
        "rating":"4.7",
        "sentiment":"negative",
        "review":"Nice product,Not as effective as claimed, just an average product..,Good Product,bribing people for 5 star rating,Most worst machine i have ever seen,Just wow. Value for money,Not as effective as claimed, just an average product, built quality medicore.,Good, very good product, very easily to use good working. But charger cable is very vary short. I lick this.,the product is that good as the rating show it to be and the reason for it is , that the seller is bribing people for 50 ruppee paytm cash and rating them 5 start , this is cheating .the quality of the product was not up to the mark and it didn't work after 2 days,Worst,Rechargeable....3 speed modes and it gives perfect and creamy froth..value for money 100 percent"
    },
    {
        "rating":"4.1",
        "sentiment":"negative",
        "review":"Good product and budget price,I purchased this product from shop for Rs 1650 including everything so why to buy from Amazon,Worst product. Like and happy,,Please don't buy this heater, it stopped working in just 2 days.... And not able to return the product also... Waste of money"
    },
    {
        "rating":"4",
        "sentiment":"negative",
        "review":"Takes space and not convenient if in a hurry,Not useful for Cotton, Linen and thick materiel fabrics,Received broken,Only for lighter fabric,There is a learning curve, it may take 2 people to do it,It looks like an imitation product , pieces don’t match properly and some look very weak,Excellent product and received in good condition,Not great. Takes space and not convenient if in a hurry. The handheld model would be better suited and more useful for frequent use.,I used this product once after reading the manual. The first impression after using it on 3 cotton shirts without starch and one pant is pathetic. None of the shirts got wrinkle free on full steam, hence you could guess what it would be in trousers.Later I found it is satisfactory on silk, nylon shirts, T shirts etc but none will get an iron effect. Wrinkle will be there in small amount and a slight wet feel when the steam cool down but it will go if fast.It is mainly useful for ladies who wear embroidered nylon, silk materials, stone work fabrics, etc etc men who use T shirts and nylon rich trousers. Otherwise, don't even think of buying it. In my case, I use cotton whites and white trousers mainly at office as I am a lawyer. Hence, for me, it is totally useless. No females at home and hence, it is another product that grab my home space.Regarding comfort while using it, I would say, I am totally disappointed as the board behind it is not much of use while using g shirt because of its size which is not that long. The last two button downwards will always hard to press it to board and we have to take the hanger hold high on one hand and thus another difficult part as the nylon material needs another hands to hold it firm. Secondly, the long full sleeves are totally difficult to do it though steam is applied, the wrinkles won't go easily add we are not pressing it to board and it will always go here and there. The top stand is a hanger shaped but the clips attached as useless as the board comes in between. For trousers, the product itself won't work good. So if we use the hanger it comes with, you need to put the switch off, place the handle in slot, take the shirt out and then only we can use the back side to steam after waiting again to steam up switch on etc otherwise steam will go on coming out of it.Any way, the product is more useful that those similar without a pressing board.The next negative thing is, manual says, for better lasting of product, and  to avoid decalcification, the water After use should be drained and cleaned. Hence, it means, you can't use it daily morning in rush while going to office. That needs little time. At the same time you can't press all dress in a stretch and can't fold it like we do with iron box. It won't work that away. So if you have long large cupboard with hangers as in mansions, you can try that.In effect, buy it if you find exceptions and usages apart from what I mentioned above.P.S :- I am seriously thinking of OLX 😒,Received a broked packedge. With broken item.,I thought it would make my task of ironing easy but it’s useless on cottons and silks . It’s great to use it on chiffon and polyester. Do not buy thinking you won’t need standard ironing anymore..,It is fantastic for marriages, where there are many dresses, net based where you can't use iron. Quick. Good for suits,It looks like an imitation product , pieces don’t match properly and some look very weak,valu Ed for money,It’s not effective and pressing clothes effectively seems to have an issue"
    },
    {
        "rating":"2",
        "sentiment":"positive",
        "review":"Bad quality,Amazing product... The heating capacity is zero .Moreover i have initiated return request. Noone has come to collect it,Best heater at this price. Quality is very good . Suggest everyone to purchase this heater.......... amazing product to buy..."
    }
]